Attached groups can only be created for view specific elements belonging to non-3d model views.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BadViewForAttachedGroup { get; }
  Visual Basic
Public Shared ReadOnly Property BadViewForAttachedGroup As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BadViewForAttachedGroup {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GroupFailures Class
  Autodesk.Revit.DB Namespace